app/controllers/api/events_controller.rb

INSERT INTO "events" ("event_date", "creator_id", "location", "title", "description", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @event = Event.new(event_params)
    @event.creator_id = current_user.id;
    if @event.save!